<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class about_seeder extends Seeder
{

    public function run(): void
    {
        DB::table('about')->insert([
            'video_url' => 'https://www.youtube.com/embed/_r58G5iM_NU?si=JZvjRRHuLSBN9fXE',
            'description' => '১ জানুয়ারি ১৯৬৩ সালে রংপুরের একমাত্র কলেজ ‘কারমাইকেল’ কে সরকারি করা হলে আসন সংখ্যা সীমাবদ্ধ হয়ে যায়। এই সময় পাশে কোন কলেজ না থাকায় ছাত্র-ছাত্রীরা পরে বিপাকে। ছাত্র-ছাত্রীদের চাহিদার তাগিদে কলেজের প্রয়োজন দেখা দিলে প্রফেসর এমান উদ্দিনের ঐকান্তিক প্রচেষ্টায় প্রফেসর ফুলে হোসেন, ডিসি ও এম কার্ণি, এডিসি আব্দুস সাত্তার, জেলা শিক্ষা অফিসার তাহেমেদুর রহমান (টি রহমান), এডভোকেট আবুল খাঁ, আমিন হোসেন, আবু সালেক, আবুল হোসেন, মঈন উদ্দিন সরকার এমপি এবং জেলার অনেক বিত্তবান ব্যক্তি অর্থ ও জমি দান করে কলেজটি প্রতিষ্ঠায় সহযোগীতা করেন। অতঃপর ২৫ জুলাই ১৯৬৩ সালে কলেজটি প্রতিষ্ঠিত হয়। প্রফেসর এমাজ উদ্দিন আহমদকে অধ্যক্ষ ও প্রফেসর ফুলে হোসেনকে উপাধ্যক্ষ করে নৈশ্য কলেজ হিসেবে কৈলাশ রঞ্জন উচ্চ বিদ্যালয়ে এবং ডে কলেজ হিসেবে রাম বাবুর জমিদার বাড়িতে (কালিধাম) কলেজটির যাত্রা শুরু। কলেজটির যাত্রা লগ্ন থেকে ১৯৯২ সাল পর্যন্ত রাজশাহী বিশ্ববিদ্যালয়ের অধিভুক্ত ছিল। প্রথম দিকে আই.এ. ক্লাশ খোলার অনুমতি দিলেও কলেজটির শিক্ষার মানের উপর ভিত্তি করে ১৯৬৫ সালে বি.এ. ক্লাশ খোলার অনুমতি দেয়। ১৯৬৭ সালে',
            'image' => 'image1.jpeg',
            'title' => 'এক নজরে কলেজ পরিচিতি'
        ]);
    }
}
